-- Додавання початкових даних до таблиць

-- Додавлення факультетів
INSERT INTO
  dbo.Faculties (Name)
  VALUES
  (N'Природничий факультет'), -- 1
  (N'Факультет комп`ютерних наук'),  -- 2
  (N'Гуманітарний факультет'),-- 3
  (N'Економічний факультет'); --4


  -- Додавлення кафедр
INSERT INTO
  dbo.Departments (Name, Financing, FacultyId)
  VALUES
  (N'Математика', 1000000, 2),
  (N'Фізика', 800000, 1),
  (N'Chemistry', 600000, 1),
  (N'Biology', 700000, 1),
  (N'Computer Science', 1200000, 2);

  INSERT INTO dbo.Departments (Name, Financing, FacultyId)
  VALUES
  (N'Психологія', 985000, 3);
  
  
  -- Додавлення груп
  INSERT INTO
  dbo.Groups (Name, Rating, Year)
  VALUES
  (N'Група A1', 4, 1), -- 1
  (N'Група B2', 5, 2), -- 2
  (N'Група C3', 3, 3), -- 3
  (N'Група D4', 2, 4), -- 4
  (N'Група E5', 1, 5); -- 5

  -- Додавлення вчителів

  INSERT INTO
  dbo.Teachers (Name, Surname, EmploymentDate, Premium, Salary, DepartmentId)
  VALUES
  (N'Іван', N'Петренко', '2010-09-01', 5000, 30000, 2), -- 1
  (N'Олена', N'Ковальчук', '2012-03-15', 7000, 35000, 2), -- 2
  (N'Микола', N'Шевченко', '2015-06-20', 6000, 32000, 1), -- 3
  (N'Світлана', N'Ткаченко', '2018-11-05', 8000, 40000, 1), -- 4
  (N'Андрій', N'Бондаренко', '2020-01-10', 5500, 31000, 3), -- 5
  (N'Ірина', N'Гончарова', '2011-07-25', 7500, 36000, 3),	-- 6
  (N'Володимир', N'Кравченко', '2013-04-30', 6500, 33000, 4), -- 7
  (N'Тетяна', N'Мельник', '2016-09-12', 8500, 41000, 4), -- 8
  (N'Олександр', N'Сидоренко', '2019-02-18', 5800, 31500, 5), -- 9
  (N'Наталія', N'Левченко', '2021-05-22', 7200, 35500, 5), -- 10
  (N'Дмитро', N'Коваленко', '2014-08-14', 6200, 32500, 4), -- 11
  (N'Юлія', N'Романенко', '2017-10-08', 7800, 37000, 4), -- 12
  (N'Віктор', N'Захарченко', '2022-03-19', 5400, 30500, 5), -- 13
  (N'Марина', N'Павленко', '2019-12-02', 6800, 34000, 5),
  (N'Сергій', N'Григоренко', '2013-05-27', 6300, 33000, 5)
  ; -- 14


  -- Додавлення зв'язків між вчителями та групами

  INSERT INTO
  dbo.TeacherGroups (TeacherId, GroupId)
  VALUES
  (1, 1),
  (1, 2),
  (2, 2),
  (2, 3),
  (3, 3),
  (3, 4),
  (4, 4),
  (4, 5),
  (5, 1),
  (5, 5),
  (6, 2),
  (6, 4),
  (7, 1),
  (7, 3),
  (8, 3),
  (8, 5),
  (9, 4),
  (9, 1),
  (10, 2),
  (10, 5);




